//查询今天是否是特殊的日子，若有，将该日文案追加到公告后面
const today = new Date();
const year = today.getFullYear();
const month = today.getMonth() + 1; // 月份从0开始，需要加1
const day = today.getDate();
if(month == 7 & day == 21){
    var text = "挨多☆米那桑(◦˙▽˙◦)，今天是柚子社♡大贤☆宗☆师「绫地宁宁」的纪念日07.21喵。将这条消息转发到十个群（笑），将会在「图书馆」遇到一位正在打☆磨桌角的宁宁的说(=^▽^=)♡，我试过了，是假的喵(。・`ω´・)，还会被骂柚♪子♪厨退群，苦亚西(◦`~´◦)，得磨，今天真的是绫地宁宁的纪念日07.21……（｀Δ´）ゞ，让我们一起为宁宁庆祝喵！Ciallo～(∠・ω< )⌒☆"}
if(month == 7 & day == 29){
    var text = "今天是7月29日，是千恋万花发行的{a}周年，将这个消息转发到5个群，下次回到乡下给外公帮忙你就会遇到白毛巫女，下流忍者，绿毛锉刀和黄毛留学生，我试过了，是假的，还会被群友骂柚子厨，但是今天真的是千恋万花{a}周年".replace(/{a}/g,String(year-2016))}
if(month == 8 & day == 7){
    var text = "博丽神社、八云邸、永远亭、是非曲直厅各方代表，及人间之里村民自治委员会在此极其沉痛的向全稗田府，全人里全乡各族人民宣告：稗田家优秀的领导者，久经考验的忠诚的封建主义战士，幻想乡杰出的文学家、历史学家、拳击运动员，我们敬爱的稗田阿求同志于2024年8月7日0时因先天性身体衰弱导致多脏器衰竭，经长期多方精心治疗，终因病情恶化，医治无效，与稗田府内不幸逝世，享年30岁。<br/>根据阿求同志生前遗愿，葬礼将在人间之里举行。由当代博丽巫女、本居小铃、上白泽慧音组成治丧委员会。追悼大会在人间之里稗田宅内举行。<br/>追悼仪式当日，上午，稗田宅礼堂庄严肃穆，哀乐低回。稗田阿求同志的遗体安卧在鲜花翠柏丛中，正厅上方悬挂着黑底白字的横幅“沉痛悼念穗田阿求同志” 横幅下方是阿求同志的遗像<br/>上午9时许，博丽灵梦，上白泽慧音、本居小铃、射命丸文、洩矢诹访子、二岩揣藏、孙美天、小野小町等人，在哀乐声中缓步来到阿求同志的遗体前进行默哀。<br/>天狗社2024年8月7日0时12分电<br/><img src='https://i0.hdslb.com/bfs/new_dyn/568db02530ca4f3ae4121ad9e4e090783546642703714312.jpg' style='width:80%'/>"
}
if(text!=undefined){
text = "<br/>"+text;
document.getElementById("announcement").innerHTML = document.getElementById("announcement").innerHTML + text}